<?php error_reporting(0); $name = $_GET['name']; 

/***************************************************************
****	Script : Happy-BD			        ********************
****	By : Mohammed Cha   	********************************
****************************************************************/



/***************************************************************
السلام عليكم .. 

هاد البلان بحال الول لي لحت ليكم .. ديال عيد المولد النبوي ..
وكن هدا فيه واحد اللعيبة زايدة ..

هيا البصمة ..

جرب في الموبايل باش تشوف .. 
تطلع غير في الموبايل فقط 
يعني اداكنتي في جهاز الحاسوب ما تطلعش ليك الصفحة ديال البصمة 

المهم البصمة خدامة فير في المبايل فقط  و ادا كانت سبقتي و عمرتي الاسم ديال السيد لي غادي ترسل ليه البطاقة
و الاسم ضاهر قدامك .. يعني البطاقة جاهزة للإرسال .. 
تما فين تاتولي تطلع البصمة .. لانه السيد مع غادي يفتح الصفحة مع تطلع ليه 

يعني تكون في الموبايل .. و البطاقة جاهزة .. عاد تاتبان ليك البصمة .. و تاتبقا ناقر عليها 
حتى تسكاني ليك صبعك زعما ههههههه 

و يمكن ليك توقفها بمرة هاد الصفحة ديال البصمة .. ادا غيرتي لتحت داك  الرقم من 1 الى 0 .. 
صافي ما تبقاش تبان بمرة .. 
****************************************************************/

/** عنوان الموقع **/
$page_name = $name."Special surprise gift"; 



/***************************************************************
****	اعدادات البصمة			 		**********************
****************************************************************/

/***    تشغيل او ايقاف خاصية البصمة 0/1    ***/
$finger = "1"; // 1 = on  ****** 0 = off

/***   نص صفحة البصمة    ***/
$text_finger1 = "You have a special surprise gift";
$text_finger2 = "Scan your finger to view your surprising gift.";





/***************************************************************
****	اعدادات المشاركة في واتساب		**********************
****************************************************************/

/***    رابط الموقع    ***/
$sharing_url = "https://website.com";

/***    رسالة الوتساب     ***/
$sharing_message = $name." You have a special surprise gift Here"; 

/***    رسالة الوتساب     ***/
$sharing_invite = "Click here to view your big surprising gift.";

/***    رسالة الوتساب     ***/
$sharing_advice = "Just a big surprise gift here!";






/***************************************************************
****	اعدادات مشاركة المنشور في فايسبوك		*************
****************************************************************/

/***    رسالة التهنئة     ***/
$sharing_name = "Click here to view your big surprising gift."; 

/***    رسالة التهنئة     ***/
$sharing_description = "Just a big surprise gift here!";






/***************************************************************
****	محتوى الصفحة		***********************************
****************************************************************/

/***   العنوان الرئيسي اعلى الصفحة    ***/
$happy_from = "HAPPY BIRTHDAY";

/***   العنوان الثانوي اعلى الصفحة    ***/
$happy_message = "All the best wishes";





/***************************************************************
****	اعدادات انشاء بطاقة جديدة		**********************
****************************************************************/

/***   شرح او توضيح طريقة كتابة بطاقة جديدة    ***/
$aid_creat = "You can create your own greeting message by entering the name in the box bellow and clicking the Create button";





/***************************************************************
****	اعدادات غوغل .. ادسنس + اناليتكس		**************
****************************************************************/

/***   google adsense validation ID    ***/
$ads_validation = "ca-pub-XXXXXXXXXXXXXXXX";


/***   data ad client small   ***/
$small_ads_id = "ca-pub-XXXXXXXXXXXXXXXX";
                
/***   data ad solt small   ***/
$small_ads_slot = "XXXXXXXXXX";
          



/***   data ad client big    ***/
$big_ads_id = "ca-pub-XXXXXXXXXXXXXXXX";

/***   data ad solt big    ***/
$big_ads_slot = "XXXXXXXXXX";




/***   analytics ID    ***/
$tracking = "UA-XXXXXXXXX-1";






/***************************************************************
****	 الرقم الخاص بتطبيق فايسبوك     		**************
****************************************************************/

/***   الرقم الخاص بتطبيق فايسبوك     ***/
$fb_app_id = "XXXXXXXXXXXXXXXX";




/***************************************************************
****	الله معاكم الدراري     		**************
****************************************************************/

?>